In [5]:
# Importing the libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plta
import seaborn as sns

**Loading Dataset**

In [6]:
df= pd.read_csv("D:\\domestic_visitors_2016.csv")
df1=pd.read_csv("D:\domestic_visitors_2017.csv")
df2=pd.read_csv("D:\domestic_visitors_2018.csv")
df3=pd.read_csv("D:\domestic_visitors_2019.csv")

**Creating Helping Function**

In [22]:
def head(n):
    return n.head()

def shape(n):
    return n.shape

def null(n):
    return n.isnull().sum()

def inf(n):
    n.info()

def dupli(n):
    return n.duplicated().sum()

def drpna(n):
    n.dropna(inplace=True)

**Top 5 Rows of all Dataset**

In [23]:
print("2016 \n",head(df))
print("\n")
print("2017 \n",head(df1))
print("\n")
print("2018 \n",head(df2))
print("\n")
print("2019 \n",head(df3))

2016
    district        date     month  year visitors
0  Adilabad  01-01-2016   January  2016   792136
1  Adilabad  01-02-2016  February  2016   937820
2  Adilabad  01-03-2016     March  2016   582946
3  Adilabad  01-04-2016     April  2016   341948
4  Adilabad  01-05-2016       May  2016   252887


2017
    district        date     month  year visitors
0  Adilabad  01-01-2017   January  2017   318799
1  Adilabad  01-02-2017  February  2017    83316
2  Adilabad  01-03-2017     March  2017    27508
3  Adilabad  01-04-2017     April  2017    13946
4  Adilabad  01-05-2017       May  2017    11752


2018
    district        date     month  year visitors
0  Adilabad  01-01-2018   January  2018   320356
1  Adilabad  01-02-2018  February  2018    36550
2  Adilabad  01-03-2018     March  2018    23011
3  Adilabad  01-04-2018     April  2018    14183
4  Adilabad  01-05-2018       May  2018     8197


2019
    district        date     month  year visitors
0  Adilabad  01-01-2019   January  2019    25071
1  Adilabad  01-02-2019  February  2019   406177
2  Adilabad  01-03-2019     March  2019    14347
3  Adilabad  01-04-2019     April  2019     9972
4  Adilabad  01-05-2019       May  2019     6997

**Printing Total Rows and Columns of All Dataset**

In [24]:
print("2016 \n")
print("Total Number of Rows :", df.shape[0])
print("Total Number of Columns :",df.shape[1])
print("\n")

print("2017 \n")
print("Total Number of Rows :", df1.shape[0])
print("Total Number of Columns :",df1.shape[1])
print("\n")

print("2018\n")
print("Total Number of Rows :", df2.shape[0])
print("Total Number of Columns :",df2.shape[1])
print("\n")

print("2019 \n")
print("Total Number of Rows :", df3.shape[0])
print("Total Number of Columns :",df3.shape[1])
print("\n")

2016

Total Number of Rows : 372
Total Number of Columns : 5


2017

Total Number of Rows : 372
Total Number of Columns : 5


2018

Total Number of Rows : 360
Total Number of Columns : 5


2019

Total Number of Rows : 378
Total Number of Columns : 5

**Printing the Null Values of All Dataset**

In [25]:
print("2016 \n")
print(null(df))
print("\n")

print("2017 \n")
print(null(df1))
print("\n")

print("2018 \n")
print(null(df2))
print("\n")

print("2019 \n")
print(null(df3))
print("\n")

2016

district    0
date        0
month       0
year        0
visitors    0
dtype: int64


2017

district    0
date        0
month       0
year        0
visitors    0
dtype: int64


2018

district    0
date        0
month       0
year        0
visitors    0
dtype: int64


2019

district    0
date        0
month       0
year        0
visitors    0
dtype: int64

**Findings**

We have null values in 2018 and 2019 dataset in visitors column

I decided to remove it instead of impute it because its a visitors column which means that day have holiday and visitors won't visit the place.

In [26]:
df2.dropna(inplace=True)
df3.dropna(inplace=True)

In [16]:

print("2018 \n")
print(null(df2))
print("\n")

print("2019 \n")
print(null(df3))
print("\n")

2018

district    0
date        0
month       0
year        0
visitors    0
dtype: int64


2019

district    0
date        0
month       0
year        0
visitors    0
dtype: int64

**Printing the Duplicates Values**

In [39]:
print("2016 \n", dupli(df))
print("2017 \n", dupli(df1))
print("2018 \n", dupli(df2))
print("2019 \n", dupli(df3))

2016
 0
2017
 0
2018
 0
2019
 0

**Removing the White space**

In [33]:
df.visitors = df.visitors.str.replace(' ','')
df1.visitors = df1.visitors.str.replace(' ','')
df2.visitors = df2.visitors.str.replace(' ','')
df3.visitors = df3.visitors.str.replace(' ','')

**Converting the dtype of column**

In [48]:
df['date'] = pd.to_datetime(df['date'])
df1['date'] = pd.to_datetime(df1['date'])
df2['date'] = pd.to_datetime(df2['date'])
df3['date'] = pd.to_datetime(df3['date'])


df['year'] = df['year'].astype('int32')
df1['year'] = df1['year'].astype('int32')
df2['year'] = df2['year'].astype('int32')
df3['year'] = df3['year'].astype('int32')

In [49]:
df['visitors']=pd.to_numeric(df['visitors'], errors='coerce')
df1['visitors']=pd.to_numeric(df1['visitors'], errors='coerce')
df2['visitors']=pd.to_numeric(df2['visitors'], errors='coerce')
df3['visitors']=pd.to_numeric(df3['visitors'], errors='coerce')

In [50]:
# replace NaN and inf values with Zero

df['visitors']= df['visitors'].replace([np.nan,np.inf],0)
df1['visitors']= df1['visitors'].replace([np.nan,np.inf],0)
df2['visitors']= df2['visitors'].replace([np.nan,np.inf],0)
df3['visitors']= df3['visitors'].replace([np.nan,np.inf],0)

In [51]:
# cast the column to int32


df['visitors'] = df['visitors'].astype('int32')
df1['visitors'] = df1['visitors'].astype('int32')
df2['visitors'] = df2['visitors'].astype('int32')
df3['visitors'] = df3['visitors'].astype('int32')

In [53]:
# Printing the information of Dataset


print("2016 \n")
print(inf(df))
print("\n")

print("2017 \n")
print(inf(df1))
print("\n")

print("2018 \n")
print(inf(df2))
print("\n")

print("2019 \n")
print(inf(df3))
print("\n")

2016

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 372 entries, 0 to 371
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  372 non-null    object
 1   date      372 non-null    datetime64[ns]
 2   month     372 non-null    object
 3   year      372 non-null    int32
 4   visitors  372 non-null    int32
dtypes: datetime64[ns](1), int32(2), object(2)
memory usage: 11.8+ KB
None


2017

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 372 entries, 0 to 371
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  372 non-null    object
 1   date      372 non-null    datetime64[ns]
 2   month     372 non-null    object
 3   year      372 non-null    int32
 4   visitors  372 non-null    int32
dtypes: datetime64[ns](1), int32(2), object(2)
memory usage: 11.8+ KB
None


2018

<class 'pandas.core.frame.DataFrame'>
Int64Index: 360 entries, 0 to 371
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  360 non-null    object
 1   date      360 non-null    datetime64[ns]
 2   month     360 non-null    object
 3   year      360 non-null    int32
 4   visitors  360 non-null    int32
dtypes: datetime64[ns](1), int32(2), object(2)
memory usage: 14.1+ KB
None


2019

<class 'pandas.core.frame.DataFrame'>
Int64Index: 378 entries, 0 to 395
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  378 non-null    object
 1   date      378 non-null    datetime64[ns]
 2   month     378 non-null    object
 3   year      378 non-null    int32
 4   visitors  378 non-null    int32
dtypes: datetime64[ns](1), int32(2), object(2)
memory usage: 14.8+ KB
None

**Merging all Dataset into one Dataset named Domestic_Vistiors**

In [55]:
Domestic_Visitors = pd.concat([df,df1,df2,df3], axis=0)

In [56]:
# Printing the Top 5 Rows of Dataset

head(Domestic_Visitors)

   district       date     month  year  visitors
0  Adilabad 2016-01-01   January  2016    792136
1  Adilabad 2016-01-02  February  2016    937820
2  Adilabad 2016-01-03     March  2016    582946
3  Adilabad 2016-01-04     April  2016    341948
4  Adilabad 2016-01-05       May  2016    252887

In [58]:
# Printing the Last 5 Rows of Dataset

Domestic_Visitors.tail()

            district       date      month  year  visitors
391  Yadadri Bhongir 2019-01-08     August  2019    389010
392  Yadadri Bhongir 2019-01-09  September  2019    366862
393  Yadadri Bhongir 2019-01-10    October  2019    381860
394  Yadadri Bhongir 2019-01-11   November  2019    365990
395  Yadadri Bhongir 2019-01-12   December  2019    477635

In [59]:
# Printing the Random 10 Rows of Dataset

Domestic_Visitors.sample(10)

        district       date      month  year  visitors
235    Nizamabad 2017-01-08     August  2017      1583
110      Khammam 2017-01-03      March  2017    101878
275  Ranga Reddy 2017-01-12   December  2017         0
331  Wanaparthy  2018-01-08     August  2018     35860
335  Wanaparthy  2018-01-12   December  2018     20556
285  Sangareddy  2017-01-10    October  2017    232000
227     Nalgonda 2019-01-12   December  2019     13419
240   Peddapalli 2017-01-01    January  2017      1345
221       Nirmal 2017-01-06       June  2017    340359
320    Vikarabad 2016-01-09  September  2016         0

In [60]:
# Printing Total Number of Rows and Columns

print("Total Number of Rows :", Domestic_Visitors.shape[0])
print("Total Number of Columns :", Domestic_Visitors.shape[1])

Total Number of Rows : 1482
Total Number of Columns : 5

In [61]:
# Printing the Null values of the Dataset

null(Domestic_Visitors)

district    0
date        0
month       0
year        0
visitors    0
dtype: int64

In [62]:
# Printing the Duplicate values of the Dataset

dupli(Domestic_Visitors)

0

In [63]:
# Save the Domestic_Visitors.csv File

Domestic_Visitors.to_csv("domestic_visitors.csv", index=False)

In [64]:
data = pd.read_csv("domestic_visitors.csv")

data.head()

   district        date     month  year  visitors
0  Adilabad  2016-01-01   January  2016    792136
1  Adilabad  2016-01-02  February  2016    937820
2  Adilabad  2016-01-03     March  2016    582946
3  Adilabad  2016-01-04     April  2016    341948
4  Adilabad  2016-01-05       May  2016    252887

In [65]:
data.shape

(1482, 5)

In [66]:
data.isnull().sum()

district    0
date        0
month       0
year        0
visitors    0
dtype: int64